In [ ]:
# Cài đặt thư viện pandas
!pip install pandas

In [2]:
import pandas as pd

In [3]:
# Tạo DataFrame từ Dictionary

dict = {'Name': ['Thang','Anh'], 'Diem': [9,10] }
df = pd.DataFrame(dict)
df

    Name  Diem
0  Thang     9
1    Anh    10

In [41]:
# Load từ file a.csv
df_a = pd.read_csv('data\\a.csv')
df_a

   ID    Name Class
0   1   Thang    A1
1   2    Hung    A1
2   3      Vu    A2
3   4     Anh    A3
4   5  Thuong    A2

In [5]:
# Load từ file b.csv
df_b = pd.read_csv('data\\b.csv')
df_b

   ID  Mark
0   1    10
1   2     3
2   3     9
3   4     6
4   5     2

In [9]:
# Ghi vào file csv
df_b.to_csv('data\\b_phay.csv', index=False)

In [10]:
df_a

   ID    Name Class
0   1   Thang    A1
1   2    Hung    A1
2   3      Vu    A2
3   4     Anh    A3
4   5  Thuong    A2

In [14]:
df_a.loc[3]

ID         4
Name     Anh
Class     A3
Name: 3, dtype: object

In [18]:
df_a[['Name','Class']]

     Name Class
0   Thang    A1
1    Hung    A1
2      Vu    A2
3     Anh    A3
4  Thuong    A2

In [20]:
df_a.Class

0    A1
1    A1
2    A2
3    A3
4    A2
Name: Class, dtype: object

In [22]:
df_a_filter = df_a[['Name','Class']]
df_a_filter

     Name Class
0   Thang    A1
1    Hung    A1
2      Vu    A2
3     Anh    A3
4  Thuong    A2

In [24]:
df_b

   ID  Mark
0   1    10
1   2     3
2   3     9
3   4     6
4   5     2

In [25]:
df_b[df_b.Mark>5]

   ID  Mark
0   1    10
2   3     9
3   4     6

In [34]:
df_b[(df_b['Mark']>5) & (df_b.ID < 2)]

   ID  Mark
0   1    10

In [42]:
df_a

   ID    Name Class
0   1   Thang    A1
1   2    Hung    A1
2   3      Vu    A2
3   4     Anh    A3
4   5  Thuong    A2

In [49]:
df_b.drop(columns=['CotMoi'], inplace=True)

In [50]:
df_b

   ID  Mark  DoubleMark
0   1    10          20
1   2     3           6
2   3     9          18
3   4     6          12
4   5     2           4

In [46]:
df_b['DoubleMark'] = df_b['Mark']*2
df_b['CotMoi']=1

In [65]:
df_b_nan = pd.read_csv('data\\b_nan.csv')
df_b_nan

   ID  Mark
0   1  10.0
1   2   NaN
2   3   9.0
3   4   NaN
4   5   2.0

In [67]:
df_b_nan

   ID  Mark
0   1  10.0
1   2   7.0
2   3   9.0
3   4   7.0
4   5   2.0

In [54]:
df_b_nan.isna().any()

ID      False
Mark     True
dtype: bool

In [57]:
df_b_nan.dropna(inplace=True)

In [63]:
df_b_nan.fillna(0, inplace=True)

In [66]:
df_b_nan.fillna(df_b_nan['Mark'].mean(), inplace=True)

In [69]:
df_a

   ID    Name Class
0   1   Thang    A1
1   2    Hung    A1
2   3      Vu    A2
3   4     Anh    A3
4   5  Thuong    A2

In [70]:
df_b

   ID  Mark  DoubleMark
0   1    10          20
1   2     3           6
2   3     9          18
3   4     6          12
4   5     2           4

In [72]:
df_noi = pd.concat([df_a, df_b])
df_noi

   ID    Name Class  Mark  DoubleMark
0   1   Thang    A1   NaN         NaN
1   2    Hung    A1   NaN         NaN
2   3      Vu    A2   NaN         NaN
3   4     Anh    A3   NaN         NaN
4   5  Thuong    A2   NaN         NaN
0   1     NaN   NaN  10.0        20.0
1   2     NaN   NaN   3.0         6.0
2   3     NaN   NaN   9.0        18.0
3   4     NaN   NaN   6.0        12.0
4   5     NaN   NaN   2.0         4.0

In [74]:
df_noi_ngang =  pd.concat([df_a, df_b], axis=1)
df_noi_ngang

   ID    Name Class  ID  Mark  DoubleMark
0   1   Thang    A1   1    10          20
1   2    Hung    A1   2     3           6
2   3      Vu    A2   3     9          18
3   4     Anh    A3   4     6          12
4   5  Thuong    A2   5     2           4

In [75]:
df_merge = pd.merge(df_a, df_b, how="inner", on=['ID'])
df_merge

   ID    Name Class  Mark  DoubleMark
0   1   Thang    A1    10          20
1   2    Hung    A1     3           6
2   3      Vu    A2     9          18
3   4     Anh    A3     6          12
4   5  Thuong    A2     2           4

In [78]:
df_nhom = df_merge.groupby('Class')
df_nhom.sum()['Mark']

Class
A1    13
A2    11
A3     6
Name: Mark, dtype: int64

In [80]:
df_nhom['Mark'].mean()

Class
A1    6.5
A2    5.5
A3    6.0
Name: Mark, dtype: float64

In [82]:
df_nhom['Mark'].agg(['mean', 'min','max','sum'])

       mean  min  max  sum
Class
A1      6.5    3   10   13
A2      5.5    2    9   11
A3      6.0    6    6    6